{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 99], "dtype": "float32", "sparse": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "scaling", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAIAAAADAAAA8yYAAACXAHwAdAAAAAAAAAAAAAAAegoAAHQCAAAAAAAAAAAA\nAHoLAABTACkBTikC2gVtZWFuX9oGc2NhbGVfKQHaAXhzAQAAACD6HjxpcHl0aG9uLWlucHV0LTEt\nNjc4YzBiNzg1ODcxPvoIPGxhbWJkYT5yBgAAABYAAABzDwAAAIAAmDGddZk5rQbRGi6AAPMAAAAA\n", "defaults": null, "closure": null}}, "arguments": {}}, "name": "scaling", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 99], "dtype": "float32", "keras_history": ["input", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dense", "config": {"name": "hidden1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 99], "dtype": "float32", "keras_history": ["scaling", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "hidden2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["hidden1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["hidden2", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "hidden1/kernel", "shape": [99, 64], "dtype": "float32"}, {"name": "hidden1/bias", "shape": [64], "dtype": "float32"}, {"name": "hidden2/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "hidden2/bias", "shape": [32], "dtype": "float32"}, {"name": "output/kernel", "shape": [32, 8], "dtype": "float32"}, {"name": "output/bias", "shape": [8], "dtype": "float32"}]}]}